Revit 2027 API
ExporterIFCUtils.IsWallJoinedToTop Method
 Checks if wall is joined to top.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsWallJoinedToTop(
	Wall wall
)
Public Shared Function IsWallJoinedToTop (
	wall As Wall
) As Boolean
public:
static bool IsWallJoinedToTop(
	Wall^ wall
)
static member IsWallJoinedToTop :
        wall : Wall -> bool
Parameters
wall Wall
 The wall.
Return Value
Boolean
 True if wall is joined to top, false if not.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace